# 21.10.02. 풀이

# -------------- 출력변환 --------------

# 6027. 10진 정수 입력받아 16진수로 출력하기1
# 10진수를 입력받아 16진수(hexadecimal)로 출력해보자.

n = int(input())
print('%x'%n)

# 추가 참고 답안)
a = input()
n = int(a)            #입력된 a를 10진수 값으로 변환해 변수 n에 저장
print('%x'% n)  #n에 저장되어있는 값을 16진수(hexadecimal) 소문자 형태 문자열로 출력



# 6028. 10진 정수 입력받아 16진수로 출력하기2
# 10진수를 입력받아 16진수(hexadecimal)로 출력해보자.

n = int(input())
print('%X'%n)

# 추가 참고 답안)
a=input()
a=int(a)
print("%X"%a)   #n에 저장되어있는 값을 16진수 대문자 형태 문자열로 출력


# 6029. 출력하기01
# 6030. 출력하기01
